# IsClosed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TriangulatedShellComponent..::..IsClosed Property
TriangulatedShellComponent Class See Also
---
True if and only if the triangulation represents a topologically closed shell (i.e., each edge is shared by two triangles).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsClosed { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsClosed As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsClosed {
	bool get ();
}
```

# See Also
TriangulatedShellComponent Class
Autodesk.Revit.DB Namespace